target = ["1,2,3,4", "1,2,3,4,50", "qwerty1,2,3"]   # Список рядків, які потрібно обробити
target_error = ["qwerty1", "qwerty2", "qwerty3"]  # Список рядків, які містять помилки

def sum_of_numbers(arr):    # Функція, яка приймає список рядків і повертає список сум чисел або повідомлення про помилку
    result = []
    for i in arr:
    
        try:
            arr = i.split(",")  # Розділяємо рядок на окремі числа, використовуючи кому як роздільник
            arr = [int(n) for n in arr] # Перетворюємо кожен елемент списку з рядка в ціле число
            result.append(sum(arr)) # Додаємо суму чисел до результату
        
        except ValueError:
            result.append("Не можу це зробити!") # Якщо рядок містить нечислові значення, додаємо повідомлення про помилку до результату

    return result # Повертаємо список результатів

print(sum_of_numbers(target)) # Викликаємо функцію з нашим списком рядків і виводимо результат
print(sum_of_numbers(target_error)) # Викликаємо функцію з нашим списком рядків, які містять помилки, і виводимо результат